<script>

import { ref, reactive } from 'vue'
import RouteCard from '../../components/routeCard.vue'


import { Swiper, SwiperSlide } from 'swiper/vue';
import { Controller } from 'swiper';
import SwiperCore, {
  FreeMode,Pagination
} from 'swiper';
import 'swiper/css';
import "swiper/css/free-mode"
import "swiper/css/pagination"



SwiperCore.use([FreeMode, Pagination]);

export default {
  name: 'Home',
  components: {
    Swiper,
    SwiperSlide,
    RouteCard
  
  },                                             
  setup(){
    const show = ref(true)
    const model = ref(null)
    
    const items = reactive({  
      data: [
        {
          title : '台南-美麗公園道自行車道',
          content : '美麗公園道自行車道位於台南市區，總長11.9公里，與環運河線自行車道、海洋休閒線自行車道三線合一，為一完整的環狀自行車系統，另兩條位於安平區，只要以古蹟、海洋為主要景觀重點，美麗公園道自行車道則串連了台南市各大公園...（繼續閱讀）',
          imgUrl: 'https://source.unsplash.com/collection/9605089'

        },
        {
          title : '台南-美麗公園道自行車道',
          content : '美麗公園道自行車道位於台南市區，總長11.9公里，與環運河線自行車道、海洋休閒線自行車道三線合一，為一完整的環狀自行車系統，另兩條位於安平區，只要以古蹟、海洋為主要景觀重點，美麗公園道自行車道則串連了台南市各大公園...（繼續閱讀）',
          imgUrl: 'https://source.unsplash.com/collection/9605089'

        },
        {
          title : '台南-美麗公園道自行車道',
          content : '美麗公園道自行車道位於台南市區，總長11.9公里，與環運河線自行車道、海洋休閒線自行車道三線合一，為一完整的環狀自行車系統，另兩條位於安平區，只要以古蹟、海洋為主要景觀重點，美麗公園道自行車道則串連了台南市各大公園...（繼續閱讀）',
          imgUrl: 'https://source.unsplash.com/collection/9605089'

        },
        {
          title : '台南-水鳥公園自行車道',
          content : '美麗公園道自行車道位於台南市區，總長11.9公里，與環運河線自行車道、海洋休閒線自行車道三線合一，為一完整的環狀自行車系統，另兩條位於安平區，只要以古蹟、海洋為主要景觀重點，美麗公園道自行車道則串連了台南市各大公園...（繼續閱讀）',
          imgUrl: 'https://source.unsplash.com/collection/9605089'

        },
        {
          title : '台南-水鳥公園自行車道',
          content : '美麗公園道自行車道位於台南市區，總長11.9公里，與環運河線自行車道、海洋休閒線自行車道三線合一，為一完整的環狀自行車系統，另兩條位於安平區，只要以古蹟、海洋為主要景觀重點，美麗公園道自行車道則串連了台南市各大公園...（繼續閱讀）',
          imgUrl: 'https://source.unsplash.com/collection/9605089'

        }
      ]
    })

    const slideSwiper = (to) => {
      if(to > 0 ) routeSlides.value.slideNext()
      else routeSlides.value.slidePrev()
    }

    const routeSlides = ref(null)
    const setSwiper = (swiper) => {
      routeSlides.value = swiper;
    };

   

    return { show, model, items,setSwiper ,slideSwiper, Controller }
  }                                               //*
}
</script>

<template>
   <v-card
      class="mx-auto mt-10 rounded-lg"
      color="#E5E5E5"
  
  >
    <v-img
      src="https://source.unsplash.com/hHUJWgpeJr0"
      aspect-ratio="16/9"
      max-width="1120"
      max-height="630"
      class="rounded-lg mx-auto"
      style="overflow: visible;"
      cover
      
    >
      <v-card-title>
      </v-card-title>
       
    

    


    


    <div style="position:absolute;top:14vh;left:5vw;">
      <v-card color="transparent"   >
      <v-row justify="start">
        <v-col md="1">
          <v-card class="trans_card  " @click="slideSwiper(-1)" width="41px"  height="100%">
            <svg width="15" height="100%" viewBox="0 0 15 32" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M14.5 2.86061L12.3766 0L0.5 16L12.3766 32L14.5 29.1394L4.74679 16L14.5 2.86061Z" fill="white"/>
            </svg>
   


          </v-card>
        </v-col>
        <v-col md="8">
          <swiper ref="routeSlides" :slidesPerView="'auto'" :spaceBetween="40" :freeMode="true"  class="mySwiper" @swiper="setSwiper" >
            <swiper-slide v-for="i in items.data" :key="i">
              <route-card :title="i.title" :imgUrl="i.imgUrl"></route-card>    
            </swiper-slide> 
          </swiper>
        </v-col>
        <v-col md="1" class="pl-12">
          <v-card class="trans_card  " @click="slideSwiper(1)" width="41px"  height="100%">
            <svg width="15" height="100%" viewBox="0 0 15 32" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M0.5 29.1394L2.62339 32L14.5 16L2.62339 1.03829e-06L0.499997 2.86061L10.2532 16L0.5 29.1394Z" fill="white"/>
            </svg>

   


          </v-card>
        </v-col>

      </v-row>
      
      </v-card>
    </div>

    <div style="position:absolute;top:7vh;left:5vw">
      <svg width="313" height="64" viewBox="0 0 313 64" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g filter="url(#filter0_d_24_130)">
        <path d="M4 0H309V56H4V0Z" fill="white"/>
        <path d="M103.748 36.56V33.464H115.892V36.56H103.748ZM115.892 28.328V31.4H103.748V28.328H115.892ZM115.892 23.192V26.264H103.748V23.192H115.892ZM109.844 21.056C110.252 20.192 110.636 19.16 111.02 18.152L108.356 17.84C108.188 18.776 107.9 20.024 107.564 21.056H101.516V39.92H103.748V38.624H115.892V39.824H118.244V21.056H109.844ZM151.1 19.256H139.46V21.392H151.1V19.256ZM135.236 17.84C134.06 19.568 131.756 21.704 129.764 23C130.172 23.432 130.772 24.296 131.036 24.8C133.244 23.24 135.74 20.864 137.372 18.728L135.236 17.84ZM136.172 22.976C134.564 25.688 131.972 28.424 129.524 30.176C129.98 30.608 130.772 31.592 131.06 32.072C131.828 31.448 132.644 30.704 133.436 29.912V39.944H135.668V27.44C136.652 26.24 137.54 24.992 138.284 23.768L136.172 22.976ZM151.772 25.808H138.452V27.944H146.036V37.16C146.036 37.496 145.892 37.616 145.436 37.616C145.004 37.64 143.396 37.64 141.86 37.592C142.172 38.24 142.484 39.176 142.58 39.824C144.812 39.824 146.228 39.8 147.116 39.464C148.028 39.104 148.316 38.456 148.316 37.184V27.944H151.772V25.808ZM166.004 31.04V29H170.876V31.04H166.004ZM166.004 25.304H170.876V27.296H166.004V25.304ZM178.148 25.304V27.296H173.18V25.304H178.148ZM178.148 31.04H173.18V29H178.148V31.04ZM182.9 34.52H173.18V32.864H180.38V23.456H173.18V21.968H182.108V19.928H173.18V17.864H170.876V19.928H162.092V21.968H170.876V23.456H163.844V32.864H170.876V34.52H161.396V36.536H170.876V39.944H173.18V36.536H182.9V34.52ZM209.852 27.608H202.82V25.952H209.852V27.608ZM209.852 30.776H202.82V29.096H209.852V30.776ZM209.852 33.992H202.82V32.288H209.852V33.992ZM200.732 24.296V35.624H212.036V24.296H206.588C206.828 23.792 207.092 23.264 207.308 22.712H213.98V20.888H209.78C210.308 20.168 210.86 19.304 211.412 18.488L209.228 17.888C208.868 18.776 208.172 20 207.572 20.888H203.516L204.476 20.456C204.188 19.784 203.492 18.704 202.868 17.936L201.116 18.656C201.596 19.304 202.148 20.216 202.46 20.888H198.836V22.712H204.884C204.764 23.24 204.644 23.792 204.5 24.296H200.732ZM196.964 21.824C196.652 20.792 196.1 19.184 195.644 17.936L193.7 18.536C194.084 19.808 194.66 21.488 194.948 22.544L196.964 21.824ZM197.516 28.784L197.18 28.88H195.836C196.436 27.224 197.108 25.256 197.636 23.552H192.452V25.568H194.876C194.276 27.44 193.556 29.384 192.98 30.8H196.052C195.668 32.432 195.116 34.16 194.468 35.456C193.724 35.936 192.884 36.872 192.044 37.952L193.556 40.016C194.228 38.552 195.044 36.992 195.572 36.992C196.1 36.992 196.964 37.832 197.924 38.384C199.676 39.392 201.74 39.656 204.884 39.656C207.692 39.656 212.084 39.512 213.956 39.392C213.98 38.792 214.34 37.688 214.604 37.088C211.94 37.424 207.908 37.64 204.98 37.64C202.172 37.64 199.988 37.496 198.308 36.488C197.54 36.008 197.012 35.6 196.58 35.36C197.42 33.56 198.068 31.304 198.524 29.168L197.516 28.784Z" fill="#707070"/>
        <path d="M4 0V-2H2V0H4ZM309 0H311V-2H309V0ZM309 56V58H311V56H309ZM4 56H2V58H4V56ZM4 2H309V-2H4V2ZM307 0V56H311V0H307ZM309 54H4V58H309V54ZM6 56V0H2V56H6Z" fill="#707070"/>
        </g>
        <defs>
        <filter id="filter0_d_24_130" x="0" y="0" width="313" height="64" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
        <feFlood flood-opacity="0" result="BackgroundImageFix"/>
        <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
        <feOffset dy="4"/>
        <feGaussianBlur stdDeviation="2"/>
        <feComposite in2="hardAlpha" operator="out"/>
        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
        <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_24_130"/>
        <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_24_130" result="shape"/>
        </filter>
        </defs>
        </svg>

    </div>

    <div style="position:absolute;bottom:1vh;right:-5vw">
      <v-card color="transparent" @click=";"  >
        <svg width="345" height="88" viewBox="0 0 345 88" fill="none" xmlns="http://www.w3.org/2000/svg">
          <rect x="8.38538" y="9" width="335.615" height="78" fill="white" stroke="#707070" stroke-width="2"/>
          <rect x="1" y="1" width="335.615" height="78" fill="white"/>
          <path d="M92.8986 44.576C92.6106 45.344 92.2026 46.016 91.5066 46.664C90.6186 46.112 89.8746 45.44 89.1786 44.576H92.8986ZM88.9386 40.688H93.3546V41.456C93.3546 41.72 93.3546 41.984 93.3306 42.248H88.9386V40.688ZM88.9386 37.016H93.3546V38.552H88.9386V37.016ZM100.867 37.016V38.552H96.3546V37.016H100.867ZM100.867 42.248H96.3306C96.3546 41.984 96.3546 41.72 96.3546 41.48V40.688H100.867V42.248ZM103.699 44.576V34.712H96.3546V33.296H105.187V30.752H84.1626V33.296H93.3546V34.712H86.2506V44.576H88.7946L86.6106 45.464C87.3306 46.52 88.1466 47.432 89.0826 48.152C87.7146 48.728 85.9626 49.208 83.6586 49.568C84.2826 50.24 85.0506 51.44 85.3866 52.112C88.1706 51.56 90.2826 50.768 91.8906 49.856C95.3226 51.368 99.7386 51.728 104.947 51.848C105.115 50.864 105.643 49.664 106.171 49.016C101.299 49.04 97.3626 48.944 94.2426 47.912C95.1306 46.928 95.6826 45.776 95.9946 44.576H103.699ZM121.843 34.136C120.787 35.192 119.419 36.152 117.883 36.944C117.187 36.2 116.179 35.336 115.171 34.616C115.411 34.448 115.651 34.304 115.867 34.136H121.843ZM124.507 31.496L124.003 31.616H118.939C119.395 31.184 119.827 30.752 120.235 30.32L117.163 29.6C115.555 31.472 112.699 33.512 108.835 34.952C109.459 35.36 110.347 36.344 110.779 36.992C111.547 36.656 112.267 36.296 112.963 35.912C113.803 36.608 114.667 37.4 115.315 38.072C113.107 38.936 110.659 39.536 108.235 39.896C108.739 40.52 109.291 41.696 109.555 42.416C116.467 41.12 123.283 38.144 126.379 32.624L124.507 31.496ZM125.179 42.992C124.147 44.312 122.779 45.416 121.147 46.304C120.403 45.536 119.323 44.648 118.339 43.928C118.795 43.616 119.275 43.304 119.731 42.992H125.179ZM127.579 40.328L127.051 40.472H122.755C123.283 39.944 123.739 39.416 124.219 38.864L121.123 38.144C119.299 40.472 115.987 42.824 111.043 44.36C111.643 44.864 112.459 45.92 112.795 46.568C113.899 46.184 114.931 45.728 115.891 45.248C116.755 45.968 117.715 46.784 118.387 47.48C115.363 48.56 111.787 49.112 107.995 49.376C108.451 50.096 108.931 51.344 109.147 52.136C118.291 51.272 126.163 48.752 129.547 41.456L127.579 40.328ZM137.059 48.224V45.728H148.459V48.224H137.059ZM148.459 40.616V43.088H137.059V40.616H148.459ZM148.459 35.504V37.976H137.059V35.504H148.459ZM143.275 32.768C143.659 31.904 144.043 30.968 144.403 30.008L140.947 29.624C140.827 30.584 140.563 31.736 140.299 32.768H134.155V52.064H137.059V50.864H148.459V52.04H151.507V32.768H143.275ZM177.067 31.04H165.403V33.752H177.067V31.04ZM160.795 29.672C159.643 31.352 157.363 33.512 155.371 34.784C155.875 35.336 156.595 36.488 156.955 37.112C159.235 35.528 161.827 33.056 163.555 30.8L160.795 29.672ZM161.707 34.856C160.171 37.568 157.555 40.352 155.107 42.032C155.683 42.632 156.643 43.928 157.051 44.504C157.699 43.976 158.347 43.376 159.019 42.728V52.112H161.875V39.584C162.835 38.384 163.723 37.136 164.443 35.912L161.707 34.856ZM177.667 37.64H164.395V40.352H171.475V48.704C171.475 49.064 171.307 49.16 170.875 49.16C170.443 49.184 168.859 49.184 167.491 49.112C167.875 49.928 168.235 51.176 168.355 52.016C170.491 52.016 172.027 51.968 173.035 51.536C174.091 51.104 174.379 50.312 174.379 48.776V40.352H177.667V37.64ZM184.939 42.728V41.264H189.115V42.728H184.939ZM184.939 37.664H189.115V39.128H184.939V37.664ZM196.243 37.664V39.128H192.043V37.664H196.243ZM196.243 42.728H192.043V41.264H196.243V42.728ZM201.619 46.304H192.043V45.008H199.123V35.384H192.043V34.232H200.923V31.64H192.043V29.696H189.115V31.64H180.403V34.232H189.115V35.384H182.203V45.008H189.115V46.304H179.827V48.872H189.115V52.112H192.043V48.872H201.619V46.304ZM220.819 39.368H214.699V38.048H220.819V39.368ZM220.819 42.464H214.699V41.168H220.819V42.464ZM220.819 45.608H214.699V44.288H220.819V45.608ZM212.011 36.032V47.624H223.627V36.032H218.419C218.611 35.648 218.803 35.288 218.995 34.856H225.475V32.528H221.635C222.091 31.88 222.571 31.184 223.075 30.44L220.315 29.672C219.979 30.512 219.355 31.664 218.803 32.528H215.203L216.043 32.144C215.731 31.496 215.059 30.488 214.507 29.744L212.251 30.632C212.635 31.208 213.067 31.904 213.379 32.528H210.187V34.856H215.947C215.875 35.264 215.779 35.648 215.707 36.032H212.011ZM208.795 33.68C208.459 32.6 207.859 30.992 207.403 29.696L204.883 30.464C205.291 31.76 205.939 33.512 206.179 34.592L208.795 33.68ZM209.011 40.448L208.579 40.544H207.619C208.195 38.864 208.747 36.944 209.251 35.264H203.659V37.808H205.819C205.267 39.68 204.619 41.6 204.067 43.016H207.091C206.731 44.48 206.251 45.992 205.723 47.168C204.907 47.672 204.019 48.464 203.203 49.472L205.099 52.184C205.699 50.816 206.539 49.184 207.091 49.184C207.595 49.184 208.435 49.976 209.443 50.528C211.171 51.536 213.211 51.8 216.379 51.8C219.187 51.8 223.435 51.632 225.403 51.512C225.427 50.744 225.907 49.352 226.243 48.584C223.579 48.968 219.283 49.208 216.523 49.208C213.715 49.208 211.459 49.064 209.827 48.08C209.179 47.696 208.723 47.36 208.363 47.12C209.155 45.32 209.803 43.064 210.235 40.88L209.011 40.448ZM227.587 46.976L239.899 42.224V39.728L227.587 34.976V37.88L232.651 39.608L236.323 40.904V41.024L232.651 42.32L227.587 44.048V46.976ZM241.719 46.976L254.031 42.224V39.728L241.719 34.976V37.88L246.783 39.608L250.455 40.904V41.024L246.783 42.32L241.719 44.048V46.976Z" fill="#707070"/>
          <rect x="1" y="1" width="335.615" height="78" stroke="#707070" stroke-width="2"/>
          </svg>

      </v-card>
     
    </div>
  </v-img>
    
  <v-expand-transition>
          <div v-show="show">

            <v-card-text style="opacity:0">
              I'm a thing. But, like most politicians, he promised more than he could deliver. You won't have time for sleeping, soldier, not with all the bed making you'll be doing. Then we'll go with that data file! Hey, you add a one and two zeros to that or we walk! You're going to do his laundry? I've got to find a way to escape.
            </v-card-text>
          </div>
        </v-expand-transition>
  </v-card>

</template>



<style scoped>

 .div_cus2{
   background: #3EB595;
   height: 36px;
   margin: auto 0;
 }

 .trans_card{
   background: rgba(255, 255, 255, 0.1) !important;
   backdrop-filter: blur(6px) !important ;
   -webkit-backdrop-filter: blur(3px) !important ;
 }

 .mySwiper {
   width:100%;
  height: 420px;
  background: rgba(255, 255, 255, 0.1) !important;
   backdrop-filter: blur(6px) !important ;
   -webkit-backdrop-filter: blur(3px) !important ;

}

.swiper-slide {
  text-align: center;
  font-size: 18px;
  background: #ffff;

  /* Center slide text vertically */
  display: -webkit-box;
  display: -ms-flexbox;
  display: -webkit-flex;
  display: flex;
  
  width: 23%;
}

.swiper-slide img {
  display: block;
  width: 100%;
  height: 100%;
  object-fit: cover;
}
</style>